Revit 2024 API
BuiltInFailures.SketchFailures.NoLoops Property
 Sketch is empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoLoops { get; }
Visual Basic
Public Shared ReadOnly Property NoLoops As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoLoops {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace